---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.AirSystemData.ChilledWaterLoopId
source: html/d26b6b0b-a01e-5da8-f462-0617cfd7ee28.htm
---
# Autodesk.Revit.DB.Mechanical.AirSystemData.ChilledWaterLoopId Property

The chilled water loop used for the chilled water option of cooling coil.

## Syntax (C#)
```csharp
public ElementId ChilledWaterLoopId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null